packages/cscwrapper/cscwrapper-3.0.0-py3-none-any.whl/cscwrapper/CSC/templates/GetDocuments.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:eser="http://eservices.cscfinancialonline.com/">
    <soap:Header />
    <soap:Body>
        <GetDocuments xmlns="https://eservices.cscfinancialonline.com/">
            <params>
                <param name="loginGuid">{{ guid }}</param>
                <param name="contactNo">{{ contact_no }}</param>
                <param name="orderID">{{ order_id }}</param>
                {% if selected_results is defined and selected_results is not none %}
                <param name="selectedResults">
                    <array>
                        {% for result in selected_results %}
                            <item>{{ result }}</item>
                        {% endfor %}
                    </array>
                </param>
                {% endif %}
            </params>
        </GetDocuments>
    </soap:Body>
</soap:Envelope>